Repository: Mission-KI/pruefportal-app
Catalog: resources/locales/*/default.po
Languages: de

source: The process is not ready for calculation.
de: Die Berechnung kann noch nicht gestartet werden.

source: Please log in to report bugs.
de: Bitte melden Sie sich an um Fehler zu melden.

source: You must be logged in to report bugs.
de: Sie müssen angemeldet sein, um Fehler zu melden.

source: Bug reporting is not configured. Please contact an administrator.
de: Es können momentan keine Fehler gemeldet werden. Bitte kontaktieren Sie den Administrator.

source: Title is required.
de: Es muss ein Titel angegeben werden.

source: Title must be 256 characters or less.
de: Der Titel darf maximal 256 Zeichen lang sein.

source: Description is required.
de: Bitte geben Sie eine Beschreibung an.

source: Description is too long.
de: Die Beschreibung ist zu lang.

source: Bug report submitted successfully.
de: Der Fehler wurde erfolgreich gemeldet.

source: Failed to create bug report.
de: Die Fehlermeldung konnte nicht gespeichert werden.

source: An error occurred while submitting the bug report.
de: Bei der Meldung des Fehlers ist ein Fehler aufgetreten (d'oh!).

source: The Comment has been saved.
de: Der Kommentar wurde gespeichert.

source: The Comment could not be saved. Please, try again.
de: Der Kommentar konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: Comment saved, but some files failed to upload: {0}
de: Der Kommentar wurde gespeichert. Beim Hochladen von Dateien kam es jedoch zu Fehlern: {0}

source: A new comment for the process "{0}" has been added.
de: Dem Prüfprozess "{0}" wurde ein neuer Kommentar hinzugefügt.

source: Notification: Comment added
de: Benachrichtigung: Kommentar hinzugefügt

source: The Criteria has been saved.
de: Das Kriterium wurde gespeichert.

source: The Protection Needs Analysis for the process "{0}" is completed by the examiner. Please start the VCIO.
de: Die Schutzbedarfsanalyse im Prozess "{0}" wurde fertiggestellt. Bitte starten Sie die VCIO-Einstufung.

source: Notification: PNA Completed
de: Benachrichtigung: Schutzbedarfsanalyse abgeschlossen

source: The Protection Needs Analysis has been completed and the candidate will be notified.
de: Die Schutzbedarfsanalyse wurde abgeschlossen. Die anderen Prozessteilnehmer werden informiert.

source: The Indicators has been saved.
de: Die Einstufungen wurden gespeichert.

source: The Indicators could not be saved. Please, try again.
de: Die Einstufungen konnten nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: The VCIO Self-assessment for the process "{0}" is completed by the candidate. Please start the Validation.
de: Die VCIO-Einstufung im Prüfprozess "{0}" wurde abgeschlossen. Bitte starten Sie die Validierung.

source: Notification: VCIO Self-assessment
de: Benachrichtigung: VCIO-Einstufung

source: The VCIO Self-assessment has been completed and the examiner will be notified.
de: Die VCIO-Einstufung wurde abgeschlossen. Die anderen Teilnehmer werden informiert.

source: The Validation has been saved.
de: Die Validierung wurde gespeichert.

source: The Validation could not be saved. Please, try again.
de: Die Validierung konnte nicht gespeichert werden. Bitte probieren Sie es erneut.

source: The VCIO Validation for the process "{0}" has been completed by the examiner.
de: Die Validierung der VCIO-Einstufung im Prüfprozesses "{0}" wurde durch den/die PrüferIn abgeschlossen.

source: Notification: VCIO Validation completed
de: Benachrichtigung: Validierung abgeschlossen

source: The VCIO Validation has been completed and the candidate will be notified.
de: Die Validierung wurde abgeschlossen. Die anderen Teilnehmer werden informiert.

source: The VCIO Validation for the process "{0}" has been accepted by the candidate.
de: Die Validierung der VCIO-Einstufung im Prüfprozesses "{0}" wurde durch den Prüfling akzeptiert.

source: Notification: VCIO Validation accepted
de: Benachrichtigung: Validierung akzeptiert

source: The Process has been saved.
de: Der Prüfprozess wurde gespeichert.

source: The Process could not be saved. Please, try again.
de: Der Prüfprozess konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: Invite Candidate user Subject from Project Owner: {0} for Project: {1}
de: Einladung als Prüfling zur Prüfung im Projekt {1} von {0}

source: Invite Examiner user Subject from Project Owner: {0} for Project: {1}
de: Einladung als Prüfer zur Prüfung im Projekt {1} von {0}

source: Process ID is required
de: Die Prozess-Id muss angegeben werden

source: Rolle ist für diesen Prozess bereits vergeben
de: Die Rolle ist für diesen Prozess bereits vergeben

source: Invite {0} user Subject from Project Owner: {1} for Project: {2}
de: Einladung {0} von {1} im Projekt {2}

source: The User has been removed from the Process.
de: Der Nutzer wurde aus dem Prüfprozess entfernt.

source: The Process has been deleted.
de: Der Prüfprozess wurde gelöscht.

source: The Process could not be deleted. Please, try again.
de: Der Prüfprozess konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.

source: The UCD for the process "{0}" is requested by the examiner. Please add the UCD.
de: Für den Prüfprozess "{0}" wurde eine Anwendungsfallbeschreibung angefragt. Bitte hinzufügen.

source: Notification: UCD Requested
de: Benachrichtigung: Anwendungsfallbeschreibung benötigt

source: The Candidate can start now with the Use Case Description.
de: Der Prüfling kann nun mit der Anwendungsfallbeschreibung starten.

source: The Project and Process have been saved.
de: Das Projekt und der Prüfprozess wurden gespeichert.

source: The Project could not be saved. Please, try again.
de: Das Projekt konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: The Project has been saved.
de: Das Projekt wurde gespeichert.

source: The Project has been deleted.
de: Das Projekt wurde gelöscht.

source: The Project could not be deleted. Please, try again.
de: Das Projekt konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.

source: The User could not be saved. Please, try again.
de: Der Nutzer konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: This action may have unintended consequences.
de: Diese Aktion könnte unbeabsichtigten Folgen nach sich ziehen.

source: Your session will expire in 10 minutes.
de: Ihre Sitzung läuft in 10 Minuten ab.

source: The current UCD Step has been saved.
de: Der aktuelle Schritt der Anwendungsfallbeschreibung wurde gespeichert.

source: The current UCD Step could not be saved. Please, try again.
de: Der aktuelle Schritt der Anwendungsfallbeschreibung konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: The UCD for the process "{0}" is completed by the candidate. Please review the UCD.
de: Die Anwendungsfallbeschreibung des Prüfprozesses "{0}" wurde durch den Prüfling abgeschlossen. Bitte überprüfen Sie sie.

source: Notification: UCD Completed
de: Benachrichtigung: Anwendungsfallbeschreibung abgeschlossen

source: The UCD has been saved and the examiner will be notified.
de: Die Anwendungsfallbeschreibung wurde gespeichert und der Prüfer wird benachrichtigt.

source: The UCD for the process "{0}" has been accepted by the examiner. Please wait for the Analysis of the Protection Needs.
de: Die Anwendungsfallbeschreibung des Prüfprozesses "{0}" wurde durch den Prüfer akzeptiert. Bitte warten Sie auf den Abschluss der Schutzbedarfsanalyse.

source: Notification: UCD Accepted
de: Benachrichtigung: Anwendungsfallbeschreibung akzeptiert

source: The UCD has been marked as accepted and the candidate will be notified.
de: Die Anwendungsfallbeschreibung wurde akzeptiert und der Prüfling wird benachrichtigt.

source: The UCD could not be marked as accepted. Please, try again.
de: Die Anwendungsfallbeschreibung konnte nicht auf akzeptiert gesetzt werden. Bitte versuchen Sie es erneut.

source: The UCD for the process "{0}" has been rejected by the examiner. Please review the UCD.
de: Die Anwendungsfallbeschreibung des Prüfprozesses "{0}" wurde durch den Prüfer abgelehnt. Bitte überprüfen Sie die Anwendungsfallbeschreibung.

source: Notification: UCD Rejected
de: Benachrichtigung: Anwendungsfallbeschreibung abgelehnt

source: The UCD has been marked as rejected and the candidate will be notified.
de: Die Anwendungsfallbeschreibung wurde abgelehnt, der Prüfling wird benachrichtigt.

source: The UCD could not be rejected. Please, try again.
de: Die Anwendungsfallbeschreibung konnte nicht auf abgelehnt gesetzt werden. Bitte versuchen Sie es erneut.

source: Login successful
de: Anmeldung erfolgreich

source: Invalid username or password
de: Falscher Nutzername und/oder Passwort

source: Logout successful
de: Erfolgreich abgemeldet

source: The new password has been saved
de: Das neue Passwort wurde gespeichert

source: The new password could not be saved. Please, try again.
de: Das neue Passwort konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: Your username is incorrect. Please contact the MISSION KI team.
de: Ihr Nutzername ist nicht korrekt. Bitte kontaktieren Sie den Support.

source: An email with your reset password link is on its way to you.
de: Ihnen wurde eine E-Mail mit einem Link zum Zurücksetzen des Passworts zugesendet.

source: Error sending password email. Please try again.
de: Die E-Mail zum Zurücksetzen des Passworts konnte nicht versendet werden. Bitte versuchen Sie es erneut.

source: Please open the link in your email to activate your account.
de: Bitte öffnen Sie den Link in der Ihnen zugesendeten E-Mail, um Ihr Konto zu aktivieren.

source: Your Account Data could not be saved. Please, try again.
de: Ihre Nutzendeninfomationen konnte nicht gespeichert werden. Bitte versuchen Sie es erneut.

source: Your Account has been activated
de: Ihr Konto wurde aktiviert

source: The Invitation has been accepted and your account is now activated
de: Die Einladung wurde angenommen, ihr Konto ist nun aktiv

source: Your Account Data have been saved
de: Ihre Nutzerinformationen wurden gespeichert

source: The User and all related data have been deleted.
de: Der Nutzer und alle Nutzerdaten wurden gelöscht.

source: The User could not be deleted. Please, try again.
de: Der Nutzer konnte nicht gelöscht werden. Bitte versuchen Sie es erneut.

source: The current password is incorrect.
de: Das aktuelle Passwort ist nicht korrekt.

source: The new password is invalid or does not match the confirmation.
de: Das neue Passwort ist nicht valide oder wurde nicht richtig wiederholt.

source: Your password has been updated successfully.
de: Ihr Passwort wurde erfolgreich geändert.

source: Failed to update your password. Please try again.
de: Fehler beim Ändern des Passworts. Bitte versuchen Sie es erneut.

source: The User could not be found. Please, try again.
de: Der Nutzer wurde nicht gefunden. Bitte versuchen Sie es erneut.

source: The token is invalid or has expired.
de: Das Token ist nicht falsch oder abgelaufen.

source: Reset password Subject
de: Passwort zurücksetzen

source: Register confirmation Subject
de: Anmeldung bestätigen

source: Invite User to a Process Subject
de: Einladung zur Teilnahme an einem Prüfprozess

source: A project with this name already exists
de: Ein Projekt mit diesem Namen existiert bereits

source: New Project
de: Neues Projekt

source: Projects
de: Projekte

source: Comments
de: Kommentare

source: Settings
de: Einstellungen

source: Documentation
de: Dokumentation

source: Home
de: Start

source: Edit Project
de: Projekt bearbeiten

source: Project Details
de: Projektdetails

source: New Process
de: Neuer Prüfprozess

source: Process Details
de: Prozessdetails

source: Assessment
de: Prüfung

source: Protection Needs Analysis
de: Schutzbedarfsanalyse

source: VCIO Self-assessment Results
de: Ergebnisse der VCIO-Einstufung

source: VCIO Classification
de: VCIO-Einstufung

source: General
de: Allgemein

source: Enter your comment here...
de: Tragen Sie hier ihren Kommentar ein...

source: Reset
de: Zurücksetzen

source: Submit
de: Abschicken

source: Answer
de: Antworten

source: Process
de: Prüfprozess

source: Complete Protection Needs Analysis
de: Schutzbedarfsanalyse abschließen

source: Sobald Sie bestätigen, dass Sie die Anwendbarkeit der schutzbedürftigen Qualitätsdimensionen vollständig bewertet haben wird der Prüfling darüber informiert, dass nun die Selbsteinschätzung nach der VCIO-Systematik beginnen kann.
de: Sobald Sie bestätigen, dass Sie die Schutzbedarfsanalyse abgeschlossen haben, werden die anderen Teilnehmer informiert, dass nun die VCIO-Einstufung beginnen kann.

source: Die Anwendbarkeit der Qualitätsdimensionen wurde vollständig bewertet.
de: Die Schutzbedarfe aller Kriterien wurden vollständig bewertet.

source: Bei Unklarheiten kann der Prüfling per Kommentarfunktion auf Sie zukommen.
de: Bei Unklarheiten kann ein weiterer Austausch per Kommentarfunktion stattfinden.

source: Accept and submit
de: Akzeptieren und abschicken

source: Complete Rating
de: Bewertung abschließen

source: Next step
de: Nächster Schritt

source: N/A
de: nicht anwendbar

source: Error
de: Fehler

source: The requested address {0} was not found on this server.
de: The Addresse {0} wurde nicht gefunden.

source: An Internal Error Has Occurred.
de: Es ist ein interner Fehler aufgetreten.

source: VCIO-Validierung
de: Validierung

source: Accept Validation
de: Validierung akzeptieren

source: Ich habe die Validierung der Selbsteinschätzung zur Kenntnis genommen und bestätige diese.
de: Ich habe die Validierung der VCIO-Einstufung zur Kenntnis genommen und bestätige diese.

source: Complete Self-assessment
de: Einstufung abschließen

source: Vielen Dank für Ihre Selbsteinstufung. Sie können nun den nächsten Prozessschritt anstoßen: die Validierung durch den/die PrüferIn.
de: Vielen Danke für die Einstufung. Sie können nun den nächsten Prozessschritt anstoßen: die Validierung durch den/die PrüferIn.

source: Sobald Sie bestätigen, dass ihre Selbsteinstufung korrekt und vollständig erstellt wurde, wird der/die PrüferIn darüber informiert, dass die Validierung gestartet werden kann. Den Stand der Prüfung können Sie jederzeit in ihrem Dashboard einsehen.
de: Sobald Sie bestätigen, dass die VCIO-Einstufung korrekt und vollständig erstellt wurde, wird der/die PrüferIn darüber informiert, dass die Validierung gestartet werden kann. Den Stand der Prüfung können Sie jederzeit in ihrem Dashboard einsehen.

source: Die VCIO-Selbsteinstufung wurde vollständig bewertet.
de: Die VCIO-Einstufung ist vollständig.

source: Bei Unklarheiten kann der Prüfer in der Validierung und per Kommentarfunktion auf Sie zukommen.
de: Bei Unklarheiten kann der/die PrüferIn in der Validierung per Kommentarfunktion auf Sie zukommen.

source: Complete Validation
de: Validierung abschließen

source: Die Validierung der Selbsteinstufung nach VCIO-Kriterien ist korrekt und vollständig.
de: Die Validierung der VCIO-Einstufung ist korrekt und vollständig.

source: Für jede der Qualitätsdimensionen des Qualitätsstandards, bezüglich deren Kriterien ein Schutzbedarf in der vorangegangenen Analyse durch den/die PrüferIn festgestellt wurde, nehmen Sie nun eine Selbsteinstufung des KI-Systems vor und liefern bitte die geforderten Evidenzen, um diese Einstufung zu belegen.
de: Bitte nehmen Sie nun eine Einstufung vor, inwieweit ihr KI-System die relevanten Qualitätskriterien gemäß Standard erfüllt. Sie haben die Möglichkeit, die Einstufungen mithilfe von Evidenzen (Text, Unterlagen) zu belegen.

source: Selbsteinschätzung
de: Einstufung

source: Evidence
de: Evidenz

source: Please enter Evidences.
de: Bitte geben Sie Evidenzen an.

source: Currently editing
de: Bearbeite gerade

source: Evidenzen
de: Bitte stellen Sie Evidenzen zur Verfügung

source: Für jede der sechs Qualitätsdimensionen des Qualitätsstandards, bezüglich deren Kriterien ein Schutzbedarf in der vorangegangenen Analyse festgestellt wurde, nehmen Sie nun eine Einstufung aus externer Sicht vor und prüfen die geforderten Evidenzen des Prüflings.
de: Bitte validieren Sie nun die Einstufungen des Prüflings unter Berücksichtigung der bereitgestellten Evidenzen.

source: Ergebnis der VCIO Selbsteinschätzung
de: Ergebnis der VCIO-Einstufung

source: VCIO Self-assessment
de: VCIO-Einstufung

source: Einstufung
de: VCIO-Einstufung

source: About
de: Über

source: Das kann sich aber schnell ändern. Sobald der Prüfprozess gestartet ist, werden Sie an dieser Stelle jederzeit nachvollziehen können, wer gerade was macht und wo Sie im Prozess stehen. Beginnen Sie damit, indem Sie ein neues Prüfprojekt anlegen.
de: Das kann sich aber schnell ändern. Sobald der Prüfprozess gestartet ist, werden Sie an dieser Stelle jederzeit den Stand Ihrer Prüfprozesse nachvollziehen können. Beginnen Sie, indem Sie ein neues Projekt anlegen.

source: Welcome
de: Willkommen

source: Please login to see your dashboard
de: Bitte melden Sie sich an um Ihr Dashboard anzuzeigen

source: Terms of Service
de: Impressum

source: Privacy Policy
de: Datenschutzerklärung

source: No comments found
de: Noch keine Kommentare vorhanden

source: Edit Process
de: Prüfprozess bearbeiten

source: My Projects
de: Meine Projekte

source: Edit
de: Bearbeiten

source: Delete
de: Löschen

source: Are you sure?
de: Sind Sie sicher?

source: Request Use Case Description
de: Anwendungsfallbeschreibung anfragen

source: Add UCD
de: Anwendungsfallbeschreibung hinzufügen

source: Edit UCD
de: Anwendungsfallbeschreibung bearbeiten

source: View UCD
de: Anwendungsfallbeschreibung anzeigen

source: Create New Project
de: Neues Projekt anlegen

source: Project
de: Projekt

source: The foundation of an assessment process is the project, which it is assigned to. A project can be understood as a "roof" for multiple assessment processes. Example: The project "Company-AI" could include the assessment processes "HR Tool", "Process Automation", and "Production Assistant".
de: Prüfprozesse werden durch Projekte gebündelt. Ein Projekt kann sich beispielsweise auf ein KI-System innerhalb eines Unternehmens oder einer Organisation beziehen.

source: General Information
de: Allgemeine Informationen

source: Project Name
de: Projektname

source: Choose a descriptive name that clearly identifies the project. This will be the umbrella under which all assessment processes are organized.
de: Wählen Sie einen knackigen Begriff, der das Projekt klar identifiziert. Das Projekt bündelt alle relevanten Prüfprozesse.

source: A project can contain multiple separate assessment processes.
de: Ein Projekt kann mehrere separate Prüfprozesse beinhalten.

source: Please enter a project name.
de: Bitte geben Sie einen Projektnamen ein.

source: e.g., Organization, Testing Area, etc.
de: z.B. der Name eines Produkts

source: Project Description
de: Projektbeschreibung

source: Choose a clear name that helps assessment participants orient themselves. You can edit the Project Description later.
de: Wählen Sie einen deutliche Beschreibung, anhand derer sich Prüfbeteiligte gut orientieren können. Sie können die Projektbeschreibung später noch einmal ändern.

source: Please enter a Project Description.
de: Bitte geben Sie eine Projektbeschreibung ein.

source: e.g., Image Recognition
de: z.B. Bilderkennung

source: Process Name
de: Name des Prüfprozesses

source: Choose a clear name that helps assessment participants orient themselves. You can add more processes from the project page later.
de: Wählen Sie einen möglichst eindeutigen Namen, der es Prüfbeteiligten erleichtert, sich zu orientieren. Sie können auf der Projektseite jederzeit weitere Prüfprozesse hinzufügen.

source: Please enter a process name.
de: Bitte geben Sie einen Namen für den Prüfprozess ein.

source: Process Description
de: Beschreibung des Prüfprozesses

source: Add a brief but meaningful description of what this assessment process is about.
de: Ergänzen Sie eine kurze aussagekräftige Beschreibung dafür, worum es in dem Prüfprozess geht.

source: Cancel
de: Abbrechen

source: Create Project
de: Projekt anlegen

source: Title
de: Titel

source: Description
de: Beschreibung

source: View
de: Anzeigen

source: Projekt-Owner
de: Projektverantwortlicher

source: Protection Needs Analysis Demo - Server-side Rendering
de: Schutzbedarfsanalyse Demo - Server-side Rendering

source: Protection Needs Analysis Demo
de: Schutzbedarfsanalyse Demo

source: Usecase Description progress bar:
de: Anwendungsfallbeschreibung progress bar:

source: Usecase Description progress bar
de: Anwendungsfallbeschreibung Progress bar

source: The process is finished completely and correctly
de: Vollständig und korrekt abgeschlossen

source: The examiner will contact you after the review is finished.
de: Der Prüfer meldet sich, nachdem die Bewertung abgeschlossen wurde.

source: Actions
de: Aktionen

source: Save Draft
de: Entwurf speichern

source: Review UCD
de: Anwendungsfallbeschreibung prüfen

source: Reject UCD
de: Anwendungsfallbeschreibung ablehnen

source: Confirm: Are you sure you want to reject the UCD for {0} back to the candidate?
de: Bestätigen: Sind Sie sicher, dass Sie die Anwendungsfallbeschreibung für {0} zurückgeben wollen?

source: Accept UCD
de: Anwendungsfallbeschreibung akzeptieren

source: Confirm: Are you sure you accept the UCD for {0} from the candidate?
de: Bestätigen: Sind Sie sicher, dass sie die Anwendungsfallbeschreibung für {0} akzeptieren wollen?

source: UCD
de: Anwendungsfallbeschreibung

source: Accept Invitation
de: Einladung annehmen

source: New Password
de: Neues Passwort

source: Enter your new password
de: Geben Sie Ihr neues Passwort ein

source: Password must be at least 8 characters and include at least one number and one special character
de: Das Passwort muss mindestens 8 Zeichen lang sein und mindestens eine Zahl und ein Sonderzeichen enthalten

source: Set Password
de: Passwort festlegen

source: Back to Login
de: Zurück zur Anmeldung

source: Please set a password for your account:
de: Bitte legen Sie ein Passwort für Ihr Konto fest:

source: Log in
de: Anmeldung

source: Email Address
de: E-Mail Adresse

source: name@domain.com
de: name@organisation.de

source: Please enter a valid email address
de: Bitte geben Sie eine gültige E-Mail Adresse ein

source: Password
de: Passwort

source: Forgot password?
de: Passwort vergessen?

source: Reset here
de: Hier zurücksetzen

source: No account yet?
de: Noch kein Konto?

source: Create one now
de: Jetzt registrieren

source: Please enter your credentials to continue
de: Bitte geben Sie ihre Anmeldedaten ein um fortzufahren

source: Register
de: Registrieren

source: Salutation
de: Anrede

source: Please select...
de: Bitte auswählen...

source: Full Name
de: Name

source: Company / Organization
de: Firma / Organisation

source: min. 8 characters, including at least one number and one special character (?!&$ etc.)
de: mind. 8 Zeichen, inklusive mind. einer Zahl und einem Sonderzeichen (?!&$ etc.)

source: Register now
de: Jetzt registrieren

source: Already registered?
de: Bereits registriert?

source: Go to login
de: Zur Anmeldung

source: Register to create assessment processes or participate in ongoing assessments.
de: Registrieren Sie sich, um Prüfprozesse anzulegen, oder an laufenden Prüfungen mitzuwirken.

source: Reset Password
de: Passwort zurücksetzen

source: Forgot your password?
de: Passwort vergessen?

source: Please enter your email address. You will receive an email with instructions to reset your password.
de: Bitte geben Sie Ihre E-Mail Adresse ein. Sie werden eine E-Mail mit weiteren Anweisung zum Zurücksetzen Ihres Passworts erhalten.

source: Remember your password?
de: Erinnern Sie sich an Ihr Passwort?

source: Set New Password
de: Neues Passwort festlegen

source: Please enter a new password for your account: {0}
de: Bitte geben Sie für Ihr Konto {0} ein neues Passwort ein
