Repository: Mission-KI/pruefportal-app
Catalog: resources/locales/*/default.po
Languages: de

source: Use 8 or more characters with a mix of letters, numbers & symbols
de: Bitte benutzen Sie 8 oder mehr Zeichen (Buchstaben, Zahlen, Sonderzeichen)

source: Update Password
de: Passwort aktualisieren

source: Account
de: Konto

source: Save Changes
de: Änderungen speichern

source: Change
de: Ändern

source: Current Password
de: Aktuelles Passwort

source: Enter your current password to verify your identity
de: Bitte geben Sie Ihr aktuelles Passwort ein um Ihre Identität zu bestätigen

source: Confirm New Password
de: Neues Passwort bestätigen

source: Please re-enter your new password
de: Passwort durch erneute Eingabe bestätigen

source: Notification Settings
de: Benachrichtigungen

source: Process Updates via Email
de: Updates zu Prüfprozessen

source: Receive important updates about your audit processes.
de: Updates zum Prüfprozess per E-Mail erhalten.

source: Comment Notifications via Email
de: Kommentare

source: Receive an email when someone comments on your posts.
de: Bei Antworten auf Ihre Kommentare eine E-Mail erhalten.

source: Delete Account
de: Konto löschen

source: Warning
de: Warnung

source: After deleting your account, your data cannot be restored. This action is permanent and cannot be undone.
de: Das Löschen Ihres Kontos ist permanent. Ihre Daten können nicht wiederhergestellt werden.

source: Are you sure you want to delete your account?
de: Sind Sie sicher, dass Sie Ihr Konto löschen wollen?

source: Password must be at least 8 characters long
de: Das Passwort muss mindestens 8 Zeichen lang sein

source: Passwords do not match
de: Die Passwörter stimmen nicht überein

source: Current password is incorrect
de: Das aktuelle Passwort ist falsch

source: Unable to verify password
de: Kann das Passwort nicht verifizieren

source: Date
de: Datum

source: Message
de: Nachricht

source: Type
de: Typ

source: Notifications
de: Benachrichtigungen

source: No new notifications
de: Keine neuen Benachrichtigungen

source: You are all caught up! Check back later for updates.
de: Sie sind auf dem neuesten Stand! Schauen Sie später wieder vorbei.

source: Close
de: Schließen

source: View PNA
de: Schutzbedarfsanalyse anzeigen

source: Add VICO
de: VCIO-Einstufung hinzufügen

source: Accept VICO Validation
de: Validierung akzeptieren

source: Add Validation
de: Validieren

source: Examiner
de: Prüfer

source: Candidate
de: Prüfling

source: Candidate Name
de: Name Prüfling

source: Candidate Email
de: E-Mail Prüfling

source: Error: The candidate and the examiner may not be the same person.
de: Fehler: Prüfling und Prüfer dürfen nicht die gleiche Person sein.

source: Examiner Name
de: Name Prüfer

source: Examiner Email
de: E-Mail Prüfer

source: My Account
de: Mein Konto

source: No actions available
de: Keine Aktionen verfügbar

source: Add Comment
de: Kommentar hinzugefügen

source: Saved comments are part of the assessment documentation and cannot be edited.
de: Gespeicherte Kommentare sind Teil der Prüfdokumentation und können nicht bearbeitet werden.

source: Content
de: Inhalt

source: No documents available
de: Keine Dokumente verfügbar

source: No value provided
de: Keine Eingabe

source: View comments
de: Kommentare anzeigen

source: Add comment
de: Kommentar hinzufügen

source: Form Navigation
de: Navigation

source: Loading...
de: Lade...

source: Page {{page}} of {{pages}}, showing {{current}} record(s) out of {{count}} total
de: Seite {{page}} von {{pages}}, zeige {{current}} Einträge von {{count}} gesamt

source: first
de: erste

source: previous
de: vorherige

source: next
de: nächste

source: last
de: letzte

source: Rate
de: Bewerten

source: No file uploaded
de: Keine Datei hochgeladen

source: View Comment
de: Kommentar anzeigen

source: Comment for {0}
de: Kommentar zu {0}

source: Invalid UseCase Description data format
de: Ungültiges Datenformat der Anwendungsfallbeschreibung

source: View file
de: Datei anzeigen

source: help@missionki.de
de: pruefportal@acatech.de

source: Toggle menu
de: Menü auf-/zuklappen

source: Main navigation
de: Hauptnavigation

source: Candidate and examiner cannot have the same email address
de: Prüfling und Prüfer können nicht die gleiche E-Mail-Adresse haben

source: Prüfer
de: PrüferIn

source: Unknown
de: Unbekannt

source: Phase {0}/6
de: Schritt {0}/6

source: Process progress: {0}/6 steps
de: Prozessfortschritt: {0}/6 Schritte

source: No data
de: Keine Daten

source: No data available to display
de: Keine Daten anzeigbar

source: Logout
de: Abmelden

source: You can set the credentials for your account "{0}" after the activation.
de: Sie können die Anmeldedaten für Ihr Konto "{0}" nach der Aktivierung einstellen.

source: Accept and activate account
de: Akzeptieren und Konto aktivieren

source: Good luck! Hope it works.
de: Viele Grüße, Ihr MISSION KI Prüfportal Team

source: Please open the link below to activate your account.
de: Bitte öffnen Sie den folgenden Link um Ihr Konto zu aktivieren.

source: Activate account
de: Konto aktivieren

source: Please open the link below to set a new password.
de: Bitte öffnen Sie den folgenden Link um ein neues Passwort festzulegen.

source: This link will expire in 10 minutes.
de: Dieser Link läuft in 10 Minuten ab.

source: Detailed information on data processing:
de: Detaillierte Informationen zu unserem Umgang mit Daten:

source: Privacy link
de: Datenschutzerklärung

source: Back
de: Zurück
